"use strict";

let tempCelcius = +prompt('введите значение температуры в градусах Цельсия');
let tempFarengate = (9 / 5) * tempCelcius + 32;
console.log(`Температура ${tempCelcius}°C = ${tempFarengate}°F`);//alt+248 = °

let admin = '';
let name = '';
name = 'Василий';
admin = name;
console.log(`admin = ${admin}`);

console.log(1000 + "108");
/*
1. Происходит конкатинация получаем "1000108"
 */

console.log(10 + 10 + "10");
/*
1. 10 складываем с 10 получаем 20
2. конкатинация 20 и "10" получаем 2010
*/
console.log(10 + "10" + 10);
/*
1. конкатинация 10 и "10 получаем "1010"
2. конкатинация "1010" и 10 получаем "101010"
 */
console.log(10 + 10 + +"10");
/*
1. унарный плюс преобразует строку "10" в целое число 10
2. сложение 10 плюс 10 плюс 10 получаем 30
 */
console.log(10 / -"");
/*
1. унарный минус преобразует пустую строку "" в -0
2. делим 10 на -0 получаем -Infinity
 */
console.log(10 / +"2,5");
/*
1. унарный плюс преобразует 2,5 в число и получаем NaN, т.к. float должно быть с .
2. деление 10 на NaN получаем NaN
 */